tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'noelmarkham/extras'
tap 'olafurpg/scalafmt'
brew 'mas'
brew 'yadm'
brew 'noelmarkham/extras/sbt-extras', args: ['HEAD']
brew 'ammonite-repl'
brew 'git'
brew 'haskell-stack'
brew 'tmux'
brew 'tree'
brew 'olafurpg/scalafmt/scalafmt'
cask 'alfred'
cask 'dash'
cask 'dropbox'
cask 'font-fira-code'
cask 'font-hasklig'
cask 'font-monoid'
cask 'intellij-idea-next-eap'
cask 'iterm2'
cask 'java'
cask 'sourcetree'
cask 'sublime-text'
cask 'atom'
cask 'atom-beta'
cask 'visual-studio-code'
cask 'visualvm'
mas 'Quiver', id: 866773894
mas 'Textual', id: 896450579
mas 'Kindle', id: 405399194
mas 'Markdown Pro', id: 465965038
mas 'Microsoft OneNote', id: 784801555
mas 'Things', id: 407951449
mas 'Haskell', id: 841285201
mas 'Twitter', id: 409789998
mas 'DaisyDisk', id: 411643860
mas 'Calca', id: 635758264
mas 'OmniFocus', id: 402835630

