cask_args appdir: '~/Applications'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'd12frosted/emacs-plus'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'koekeishiya/kwm'
tap 'noelmarkham/extras'
tap 'olafurpg/scalafmt'
tap 'beeftornado/rmtree'
brew 'agda'
brew 'ammonite-repl'
brew 'artifactory'
brew 'bash' #Bash 4
brew 'cheat'
brew 'coreutils' #gnu coreutils to replace outdated osx versions
brew 'emacs-plus', args: ['with-cocoa', 'with-gnutls', 'with-librsvg', 'with-imagemagick', 'with-spacemacs-icon']
brew 'findutils' #gfind, glocate, gupdatedb, gxargs
brew 'fish'
brew 'fzf'
brew 'git'
brew 'homebrew/dupes/grep' #newer version of grep
brew 'haskell-stack'
brew 'hub'
brew 'idris'
brew 'jfrog-cli-go'
brew 'koekeishiya/kwm/kwm'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'purescript'
brew 'python3'
brew 'ripgrep'
brew 'rust'
brew 'brew-rmtree'
brew 'noelmarkham/extras/sbt-extras', args: ['HEAD']
brew 'scala'
brew 'olafurpg/scalafmt/scalafmt'
brew 'thefuck'
brew 'tldr'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'yadm'
cask 'alfred'
cask 'atom'
cask 'atom-beta'
cask 'bartender'
cask 'bettertouchtool'
cask 'beyond-compare'
cask 'cakebrew'
cask 'cheatsheet'
cask 'crossover'
cask 'dash'
cask 'devonthink-pro'
cask 'docker'
cask 'dropbox'
cask 'easyfind'
cask 'exa'
cask 'firefox'
cask 'flux'
cask 'font-fira-code'
cask 'font-hasklig'
cask 'font-monoid'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'gitter'
cask 'google-chrome'
cask 'hammerspoon'
cask 'hipchat'
cask 'intellij-idea-next-eap'
cask 'istat-menus'
cask 'iterm2'
cask 'java'
cask 'keycue'
cask 'lastpass'
cask 'microsoft-office'
cask 'moom'
cask 'pgadmin4'
cask 'qlcolorcode' #syntax hightlight code in quicklook
cask 'qlimagesize' #quick look image size and resolution
cask 'qlmarkdown' #quick look markdown support
cask 'quicklook-json' #quick look json support
cask 'quicklook-csv' #quick look csv support
cask 'qlstephen' #quick look support for text files with no extension
cask 'qlvideo' #quick look support for most video
cask 'sourcetree'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'time-out'
cask 'tomighty'
cask 'tunnelblick'
cask 'valentina-studio'
cask 'visual-studio-code'
cask 'visualvm'
cask 'vlc'
cask 'webpquicklook' #quick look support for webp format
cask 'xquartz'
mas 'Quiver', id: 866773894
mas 'Textual', id: 896450579
mas 'Kindle', id: 405399194
mas 'Markdown Pro', id: 465965038
mas 'Microsoft OneNote', id: 784801555
mas 'Things', id: 407951449
mas 'Haskell', id: 841285201
mas 'Twitter', id: 409789998
mas 'DaisyDisk', id: 411643860
mas 'Calca', id: 635758264
mas 'OmniFocus', id: 402835630
mas 'Xcode', id: 497799835
